---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailDetailLevel
source: html/c53d6a3f-1ece-cf2d-0709-a82368d7193b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailDetailLevel Property

"Detail Level"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailDetailLevel { get; }
```